# импортируем настройки для отражения эмоджи
from .config import KEYBOARD, VERSION, AUTHOR


tech_support_msg = '''💬 Связаться с менеджером

Оформить заказ ты можешь прямо в боте, выбрав товары в каталоге. Если у тебя остались вопросы, наш менеджер поможет тебе в будни с 10 до 18 по Москве. 
Bisou!🧡'''

faq_msg = '''❓ Частые вопросы

Оформление заказа
Заказать косметику Nuage Orange можно через этот бот или через менеджера:
🟠 для заказа через бот выбери нужные товары в разделе “Каталог”, далее бот попросит указать данные для доставки и пришлет ссылку на оплату заказа. После оплаты менеджер свяжется с тобой с 10 до 18 часов по Москве в рабочие дни.
🟠 для заказа через менеджера выбери “💬Связаться с менеджером” в меню.

Подарочная упаковка
Участники клуба Nuage Orange (ты уже в клубе!) могут оформить заказ в подарочной упаковке🎁. Добавьте ее в корзину при оформлении заказа.

Доставка
Доставка осуществляется по всей России. Срок доставки по Москве 1-3 дня, стоимость доставки от 400 руб., по другим регионам тебя сориентирует менеджер при подтверждении заказа. Для заказов от 5 000 руб. доставка бесплатная. Ты сможешь отслеживать статус доставки на сайте логистической компании.

Возврат
Согласно законодательству РФ, косметические средства не подлежат возврату. Исключения составляют бракованные товары и товары с истекшим сроком годности.
Свяжись с менеджером, если необходимо оформить возврат.'''

bukket_msg = '''⚡️ Здесь будет корзина'''

about_us_msg = '''✨ О бренде

                Nuage Orange — премиальная косметика со знаковыми французскими ароматами отразит твое сегодняшнее состояние и настрой.\n 
                Уходовые средства создадут невесомый барьер защиты кожи и облако утонченного аромата.'''


start_msg = '''Bienvenu, {}! Ты в клубе Nuage Orange.
Участники клуба получают доступ к эксклюзивным предложениям бренда: лимитированным продуктам, подарочным наборам, уникальным подаркам и бонусам за покупки ✨

🟠 Заказ: ты можешь оформить заказ прямо в боте, для этого выбери товары из каталога и введи данные для доставки 📦.
🟠 Оплата: бот пришлет ссылку на оплату, и после оплаты менеджер свяжется с тобой в будни с 10 до 18 по Москве для подтверждения и отправки заказа.
🟠 Доставка: по всей России.
🟠 Бонусы: при заказе от 10 000 руб. дарим конфеты Nuage Orange, от 20 000 руб. — поднос, от 50 000 руб. — свечу.
🟠 Кешбэк: начисляем 5% от суммы покупки за каждый заказ, ты можешь использовать его для оплаты будущих заказов.
🟠 Другое: Загляни в “❓ Частые вопросы”, чтобы узнать условия оформления заказа и доставки.

Если остались вопросы, ты всегда можешь связаться с менеджером 💬!'''

catalog_msg = '''📙 Каталог

Выбери категорию или доверься мне✨. 
Ты можешь оформить заказ через бот, добавляя товары в корзину.'''

order_msg = '''️️⚡️ Здесь будет оформление заказа'''

# словарь ответов пользователю
MESSAGES = {
    'catalog': catalog_msg,
    'start': start_msg,
    'about_us': about_us_msg,
    'bukket': bukket_msg,
    'faq': faq_msg,
    'tech_support': tech_support_msg,
    'order': order_msg
}
